Merge pull request #4 from Manda404/feature/async-io-performance-fix
Feature/async io performance fix
